/*
Задача 3: «Вычисление экспоненты»
Входные данные: вводятся с клавиатуры
Выходные данные: выводятся на экран
Напишите программу, которая оценивает значение е с заданной точностью е (0 <е < 1) с помощью ряда Тейлора. 
Примечание. е = 2.718281828459...
Указание. Изучите преобразование типов данных в языке Си.
Входные данные: oдно действительное число е (0 <е< 1). 
Выходные данные: oдно действительное число - значение константы е.
*/


#include <stdio.h>
#include <stdlib.h>

/*
 * 
 */
int main(int argc, char** argv) {

    return (EXIT_SUCCESS);
}

